In [2]:
import numpy as np

In [3]:
import pandas as pd

In [4]:
labels = ['a','b', 'c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a': 10, 'b': 20, 'c':30}

In [5]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [6]:
pd.Series(data = my_data, index=labels)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [9]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [10]:
d

{'a': 10, 'b': 20, 'c': 30}

In [11]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [12]:
pd.Series(data=[sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [13]:
ser1 = pd.Series([1,2,3,4],['USA','KENYA','GERMANY','JAPAN'])

In [14]:
ser1

USA        1
KENYA      2
GERMANY    3
JAPAN      4
dtype: int64

In [15]:
ser1['KENYA']

2

In [16]:
ser3 = pd.Series(data=labels)

In [17]:
ser3

0    a
1    b
2    c
dtype: object

#DataFrames

In [22]:
from numpy.random import randn

In [23]:
np.random.seed(101)

In [24]:
df

NameError: name 'df' is not defined

In [25]:
df = pd.DataFrame(randn(5,4), ['A','B','C','D','E'], ['V','W','X','Y'])

In [26]:
df

          V         W         X         Y
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [27]:
df['V']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: V, dtype: float64

In [28]:
type(df['V'])

pandas.core.series.Series

In [29]:
type(df)

pandas.core.frame.DataFrame

In [30]:
df.W

A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
E    1.978757
Name: W, dtype: float64

In [31]:
df[['V','Y']]

          V         Y
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [32]:
df['new'] = df['V'] + df['Y']

In [33]:
df['new']

A    3.210676
B    1.257083
C   -2.607169
D    1.143752
E    0.874303
Name: new, dtype: float64

In [34]:
df.drop('new',axis=1,inplace=True)

In [35]:
df

          V         W         X         Y
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [36]:
df.drop('E', axis=0) #Delete Row E

          V         W         X         Y
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [37]:
df.shape

(5, 4)

In [38]:
df.loc['A']

V    2.706850
W    0.628133
X    0.907969
Y    0.503826
Name: A, dtype: float64

In [39]:
df.columns

Index(['V', 'W', 'X', 'Y'], dtype='object')

In [40]:
df['W']

A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
E    1.978757
Name: W, dtype: float64

In [41]:
df

          V         W         X         Y
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [42]:
df

          V         W         X         Y
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [43]:
#ROWS

In [44]:
df.loc['E'] #pass the row index

V    0.190794
W    1.978757
X    2.605967
Y    0.683509
Name: E, dtype: float64

In [45]:
df.iloc[2] #index location

V   -2.018168
W    0.740122
X    0.528813
Y   -0.589001
Name: C, dtype: float64

In [46]:
df.loc[:,:]

          V         W         X         Y
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [47]:
df.loc['B','Y'] #row B column Y

0.6059653494949336

In [48]:
df.loc[['A','B'], ['W','Y']] #rows A,B and columns W,Y

          W         Y
A  0.628133  0.503826
B -0.319318  0.605965

In [49]:
df

          V         W         X         Y
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [50]:
df > 0

       V      W      X      Y
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [51]:
booldf = df > 0

In [52]:
df[booldf]

          V         W         X         Y
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [53]:
df[df > 0]

          V         W         X         Y
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [56]:
df['V'] > 0

A     True
B     True
C    False
D     True
E     True
Name: V, dtype: bool

In [57]:
df[df['V']>0]

          V         W         X         Y
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [64]:
df[df['V']<0]

          V         W         X         Y
C -2.018168  0.740122  0.528813 -0.589001

In [65]:
df

          V         W         X         Y
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [68]:
df[df['V']>0]['X']

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: X, dtype: float64

In [69]:
booldf = df['W']>0

In [70]:
booldf

A     True
B    False
C     True
D    False
E     True
Name: W, dtype: bool

In [71]:
result = df[booldf]

In [75]:
result
mycols= ['Y','X']
result[mycols]

          Y         X
A  0.503826  0.907969
C -0.589001  0.528813
E  0.683509  2.605967

In [79]:
df[(df['V']>0) & (df['X']>1)] #combine two functions , and

          V         W         X         Y
E  0.190794  1.978757  2.605967  0.683509

In [81]:
df[(df['V']>0) | (df['X']>1)] #or notation with |

          V         W         X         Y
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [82]:
df

          V         W         X         Y
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [83]:
#index

In [85]:
df.reset_index() #reset the index

  index         V         W         X         Y
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [86]:
df

          V         W         X         Y
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [87]:
newind = 'CA NY WY OR CO'.split()  #creating a list

In [88]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [89]:
df['States'] = newind

In [90]:
df

          V         W         X         Y States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [93]:
df.set_index('States') #Set a new index

               V         W         X         Y
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [92]:
df

          V         W         X         Y States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO